#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть строка с перечислением фильмов

my_favorite_movies = 'Терминатор, Пятый элемент, Аватар, Чужие, Назад в будущее'
print('первый фильм', my_favorite_movies[0:10])
print('последний фильм', my_favorite_movies[-16:-1])
print('второй фильм', my_favorite_movies[11:24])
print('второй фильм', my_favorite_movies[-22:-17])
# выведите на консоль с помощью индексации строки, последовательно:
#   первый фильм
#   последний
#   второй
#   второй с конца

# обратите внимание что запятая не должна выводиться

